{"data":
  [
  {
    "id": "d7431021-74bc-4739-831e-86ad9b99857e",
    "title": "INTERVIEW: KEVIN EASTMAN ON IDW’S TEENAGE MUTANT NINJA TURTLES",
    "content": "Kevin Eastman gained fame as the co-creator of Teenage Mutant Ninja Turtles with Peter Laird. He would go on to found creator-friendly Tundra Publishing, which gained much acclaim during its short history. He is currently Publisher and Editor-In-Chief of Heavy Metal. In August, he returns to his roots with IDW’s new Teenage Mutant Ninja Turtles series, along with co-writer Tom Waltz and artist Dan Duncan. Westfield’s Roger Ash checked in with Eastman to learn more about this project. <br>Westfield: What drew you back to the Turtles? <br>Kevin Eastman: Besides convention sketches I haven’t really done anything with the TMNT’s since roughly 1996, when I did the Bodycount book with Simon Bisley–until some of the guys working on the new TMNT movie asked me to do some concept art–and I had a COMPLETE blast drawing the guys again–I seriously didn’t realize how much I missed them.<br>So, when my good friends at IDW, Scott Dunbier and Ted Adams, reached out and asked if I’d like to do some alternative covers on the new series–I not only jumped at the chance, but I stuck my whole foot in the door and said YES and can I come play with you guys on the stories too?<br>BUT, I have to tell you Tom Waltz and the crew down there already remastered a vision I thought was awesome on every level–and feel like the luckiest kid on the planet that I get to come play in their sandbox for a while!"
  },
  {
    "id": "0cb8b2f4-a54a-4588-9d94-39a25a03e878",
    "title": "BATMAN/TMNT II #03 (DC)",
    "content": "Batman and the Turtles go on the offensive in the belief that they can take Bane down while he’s weakened, due to a lack of Venom on the Turtles’ world. But that’s not true any more! The Turtles’ foe Baxter Stockman has found a way to reproduce the deadly substance that feeds Bane—which means the Dark Knight and the Heroes on a Half-Shell are in for the fight of their lives."
  }
  ]}
