{"data":
  [
  {
    "id": "d7431021-74bc-4739-831e-86ad9b99857e",
    "title": "INTERVIEW: KEVIN EASTMAN ON IDW’S TEENAGE MUTANT NINJA TURTLES",
    "content": "Kevin Eastman gained fame as the co-creator of Teenage Mutant Ninja Turtles with Peter Laird. He would go on to found creator-friendly Tundra Publishing, which gained much acclaim during its short history. He is currently Publisher and Editor-In-Chief of Heavy Metal. In August, he returns to his roots with IDW’s new Teenage Mutant Ninja Turtles series, along with co-writer Tom Waltz and artist Dan Duncan. Westfield’s Roger Ash checked in with Eastman to learn more about this project. <br><br>Westfield: What drew you back to the Turtles? <br><br>Kevin Eastman: Besides convention sketches I haven’t really done anything with the TMNT’s since roughly 1996, when I did the Bodycount book with Simon Bisley–until some of the guys working on the new TMNT movie asked me to do some concept art–and I had a COMPLETE blast drawing the guys again–I seriously didn’t realize how much I missed them.<br><br>So, when my good friends at IDW, Scott Dunbier and Ted Adams, reached out and asked if I’d like to do some alternative covers on the new series–I not only jumped at the chance, but I stuck my whole foot in the door and said YES and can I come play with you guys on the stories too?<br><br>BUT, I have to tell you Tom Waltz and the crew down there already remastered a vision I thought was awesome on every level–and feel like the luckiest kid on the planet that I get to come play in their sandbox for a while!"
  },
  {
    "id": "0cb8b2f4-a54a-4588-9d94-39a25a03e878",
    "title": "BATMAN/TMNT II #03 (DC)",
    "content": "Batman and the Turtles go on the offensive in the belief that they can take Bane down while he’s weakened, due to a lack of Venom on the Turtles’ world. But that’s not true any more! The Turtles’ foe Baxter Stockman has found a way to reproduce the deadly substance that feeds Bane—which means the Dark Knight and the Heroes on a Half-Shell are in for the fight of their lives."
  },
  {
    "id": "0cb8b2f4-a54a-4588-9d22-39a25a03e878",
    "title": "THE Definitive Ranking of the 'Teenage Mutant Ninja Turtles' Movies",
    "content": "6. Teenage Mutant Ninja Turtles (2014)<br><br>For anyone who’s seen it, this should be a predictable spot for this movie to land. The first Turtle movie since the 2007 completely CGI film went for a part live action, part CGI take and did everything we hoped it wouldn’t. Megan Fox stars as April O’Neil and she’s terrible. Besides her being terrible, she’s in 85% of the movie and the Turtles play backup to her. Much like the Transformers film franchise, directed by Michael Bay, the 2014 TMNT had the titular characters playing second fiddle to their human counterparts. A lot of fans don’t like the Turtles’ designs, but appearances aside, we didn’t get enough of the four brothers to know them. Their lack of screen time resulted in a lack of connection, and a lack of depth to their characterizations.<br><br>One redeemable moment? Mikey has a line where he’s talking trash to some members of The Foot where he says, “I’m a snapping turtle, fool!” I liked that and that’s about it. The movie suffered from too much Michael Bay, too much Megan Fox, too many explosions, and not enough teenagers, mutants, ninjas, or turtles. As if all that weren’t bad enough, the ending basically ripped off The Amazing Spider Man movie’s ending. This reboot is a prime example of why people don’t like reboots.<br><br>5. Teenage Mutant Ninja Turtles 3 (1993)<br><br>This movie took a cool idea and turned it into a tragic waste of an hour and half. The Turtles, thanks to their friend April O’Neil, discover a mystical scepter from feudal Japan that enables time travel. After April accidentally travels to the past, the Turtles go back to find her and return to their time. Upon their arrival, they battle a crooked arms dealer and the Lord of the clan he’s dealing guns and ammo to. Seeing the four turtles in samurai armor is pretty dope, but besides that and a couple good one liners, this film is as bland as the Turtles’ costume designs. In the two prior films, each brother had his own particular look. Their faces, coloring, and freckles helped them stand apart. In this film, they bailed on that idea and each turtle looked exactly the same with only their masks separating them from one another.<br><br>The acting is subpar across the board. Casey Jones shows up after being unexplicably absent from Secret of the Ooze, but he does little more than babysit this time around. Again, seeing the Turtles suited and booted in samurai armor is awesome. They look badass, especially when they have their face masks up to cover the fact that they’re not human. Unfortunately, the look is the best part as we don’t get to see them do hardly any fighting. The bad acting, bland Turtles designs, Casey Jones being shortchanged on screen time, and no real samurai action add up to this movie being skippable for anyone who doesn’t want to see the Turtles in samurai gear.<br><br>4. Teenage Mutant Ninja Turtles 2 : Out of the Shadows (2016)<br><br>Now, surprisingly, this is where things go from terrible to actually kind of good. The Rotten Tomatoes score and reviews do this movie no justice, especially if you’re a big Turtles fan willing to look past some plot holes and bad acting (damn you, Megan Fox). After the initial reboot fell flat on its shell, Out of the Shadows actually turned things around for the better. The Turtles were on the screen more. The movie was ACTUALLY ABOUT THEM. Their personalities were strengthened with more screen time and interaction between characters. The less Megan Fox the better.<br><br>Rocksteady and Bebop were fun and actually challenged the Turtles physically. We got to see a better, less robotic version of Shredder. We get a new Casey Jones! We got to see Baxter Stockman. We got to see Krang! The film definitely has its share of flaws. There are some plot and story development issues, there are some inconsequential villains and wasted characters, Casey Jones rollerblades, and Carmelo Anthony has a pointless cameo. Regardless, it’s the better of the two newer films and it doesn’t absolutely besmirch the TMNT name that it so boldly bears. If you haven’t already, go see this movie.<br><br>3. Teenage Mutant Ninja Turtles 2 : Secret of the Ooze (1991)<br><br>And now we’re in the Top 3. These are the truly elite of the TMNT films (if any TMNT film besides the first could be called “elite”) and some fans may be surprised I don’t have this one riding shotgun in the number two spot. Secret of the Ooze is an awesome TMNT movie. It’s fun, funny, and full of the heroes we know and love. It has great villains too, old and new. It’s got a hotter April than the first movie, a Ninja Turtle dance scene, and there’s a fight scene where Michelangelo uses sausage links to fight bad guys. Much like the first movie, we actually see the four Turtles being what they are—TEENAGE MUTANT NINJA TURTLES. Some of the movies forget that, but not this one (or the first, or the 2007 film).<br><br>Are there missteps? Yes, of course. Casey Jones is mysteriously absent from this movie after playing a huge part in the first. The powers that be wanted the movie to be less “dark” and less “violent” than the first, so the Turtles fight less with their weapons (something you don’t realize until you realize). The human characters start to take some of the Turtles’ screen time, but that’s less a flaw here than a personal gripe.<br><br>Lastly, in what could be one of the worst moves the creators made, Vanilla Ice has a cameo. Not only does he suck, but his inclusion dates the movie. It will forever be a ’90s movie because of that choice. The first movie is timeless, but this one can’t be. The only thing worse than Vanilla Ice in a TMNT movie is Megan Fox in two TMNT movies. Grievances aside, this is a dope flick. Some fans—and friends of mine—would put this above the first movie. I wouldn’t. It’s a candle in the sun compared to the first, but it’s damn good. Secret of the Ooze has everything a Turtles movie needs, but a few minor flaws keep it from reaching its full potential.<br><br>2. TMNT (2007)<br><br>This will probably come as the biggest surprise on this list. It’s a little tough to put this one above Secret of the Ooze, but in terms of solid filmmaking and a good Turtles story being told, this movie wins that battle. In this completely CGI kind-of-reboot-kind-of-spiritual-successor to the original trilogy, fans got a change of pace. The bad guys weren’t ancient ninja nemeses or an alien brain who wanted to dominate the world, and that may be why some fans checked out. The Turtles battled against a different opponent, one based more in magic and fantasy than sci-fi. A wealthy businessman with a powerful secret is trying to gather statues that are actually ancient warrior friends of his that have been solidified in stone due to a curse he unleashed on the world. Sounds crazy, right? Well if you can make it past Turtles that walk, talk, and perform martial arts, then this shouldn’t be that hard to grasp.<br><br>If the only complaint is that fans weren’t familiar with the bad guys then that’s a good thing in my opinion. The Turtles act like the Turtles. They’re funny and brave and intelligent and tough. The movie succeeded in giving us great comedic moments, great interactions between the brothers and other characters, an awesome voice cast (which includes Patrick Stewart, Chris Evans, and more), a unique story, and maybe one of the most visually stunning fight scenes I’ve ever seen. Raph and Leo duke it out on a rooftop in the rain and that scene ALONE is worth watching the movie for. All in all, this is the second best Turtles movie there ever has been. When Nickelodeon gets brave enough to let me write and direct a Turtles movie of my own, it’ll be third best.<br><br>1. Teenage Mutant Ninja Turtles (1990)<br><br>One of the greatest lines in cinematic history and it sums up the awesomeness of this movie. Say what you will about the idea of anthropomorphic turtles using martial arts to battle a secret society of ninjas who have a grudge against the turtles’ anthropomorphic rat father—this movie is almost flawless. The story is much darker than anyone remembers. Four teens are left to fend for themselves in the mean streets (sewers) of NYC after their father is kidnapped by an evil crime lord? Sounds like HBO’s next hit series. Sure, those four teens may be turtles that walk on two feet. And sure, they may be Turtles that talk using hip-hop and surf slang. Still, that doesn’t diminish the gravitas of the story. This movie follows the original storyline of the Mirage comics pretty closely, and it excels because of that.<br><br>It’s also great because the costumes were ahead of their time. Costumes and animatronics provided by Jim Henson made the four unbelievable brothers pretty real to kids across America. Sure, the suits (and suspension of disbelief) may not hold up over time, but this movie sure does. The Turtles are the main characters as they always should be, and we get to fall in love with each brother and his unique personality. We see them succeed and celebrate with pizza and dancing. Then we see their brotherhood tested when they’re at their lowest. When they come together and bounce back it feels earned and it feels good. The human characters play great backup and provide real world interaction for the heroes as they traverse their trials and tribulations.<br><br>Shredder and The Foot Clan feel like a real threat and are built upon the scores of NYC’s mislead and confused youth. A villain manipulating angst-filled youths to establish his criminal empire? That shit is brilliant and SCARY. It could happen. It DOES happen! Teenage Mutant Ninja Turtles gets more real than anyone gave it a chance to, and it stands the test of time because of that. The Turtles curse, they skateboard, they actually fight like ninjas. The big battle between the Turtles and hordes of Foot ninjas feels intimate and personal to them, but it feels epic in scale. The final fight between Shredder and the Turtles is tense up to the final frame. I’ve been watching this movie since I was two years old and I still love every second. There’s been good Turtles movies since this one, but there will never be one AS good as this one."
  }
  ]}
